; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_15_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 - counter
	)
  (:init
		(= (value c0) 88)
	(= (value c1) 6)
	(= (value c2) 39)
	(= (value c3) 89)
	(= (value c4) 84)
	(= (value c5) 10)
	(= (value c6) 73)
	(= (value c7) 71)
	(= (value c8) 79)
	(= (value c9) 18)
	(= (value c10) 43)
	(= (value c11) 78)
	(= (value c12) 92)
	(= (value c13) 10)
	(= (value c14) 67)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
		)
	)
)

; plan
1. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 8 of 14
2. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 8 of 14
3. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 8 of 14
4. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 8 of 14
5. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 8 of 14
6. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 8 of 14
7. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 8 of 14
8. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 8 of 14
9. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 8 of 14
10. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 8 of 14
11. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 8 of 14
12. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 8 of 14
13. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 8 of 14
14. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 8 of 14
15. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 8 of 14
16. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 8 of 14
17. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 8 of 14
18. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 8 of 14
19. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 8 of 14
20. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 8 of 14
21. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 8 of 14
22. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 8 of 14
23. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 8 of 14
24. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 8 of 14
25. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 8 of 14
26. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 8 of 14
27. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 8 of 14
28. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 8 of 14
29. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 8 of 14
30. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 8 of 14
31. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 8 of 14
32. (increment c9)
   changed: (value c9) from 18 to 25
   goals met: 8 of 14
33. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 8 of 14
34. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 8 of 14
35. (increment c7)
   changed: (value c7) from 71 to 74
   goals met: 9 of 14
36. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 9 of 14
37. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 9 of 14
38. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 9 of 14
39. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 9 of 14
40. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 9 of 14
41. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 9 of 14
42. (increment c4)
   changed: (value c4) from 84 to 88
   goals met: 9 of 14
43. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 9 of 14
44. (increment c4)
   changed: (value c4) from 88 to 92
   goals met: 10 of 14
45. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 10 of 14
46. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 10 of 14
47. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 10 of 14
48. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 10 of 14
49. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 10 of 14
50. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 10 of 14
51. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 10 of 14
52. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 10 of 14
53. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 10 of 14
54. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 10 of 14
55. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 10 of 14
56. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 10 of 14
57. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 10 of 14
58. (increase_rate c13)
   changed: (rate_value c13) from 8 to 9
   goals met: 10 of 14
59. (increment c13)
   changed: (value c13) from 10 to 19
   goals met: 10 of 14
60. (increment c13)
   changed: (value c13) from 19 to 28
   goals met: 10 of 14
61. (increment c13)
   changed: (value c13) from 28 to 37
   goals met: 10 of 14
62. (increment c13)
   changed: (value c13) from 37 to 46
   goals met: 10 of 14
63. (increment c13)
   changed: (value c13) from 46 to 55
   goals met: 10 of 14
64. (increment c13)
   changed: (value c13) from 55 to 64
   goals met: 10 of 14
65. (increase_rate c13)
   changed: (rate_value c13) from 9 to 10
   goals met: 10 of 14
66. (increment c13)
   changed: (value c13) from 64 to 74
   goals met: 9 of 14
67. (decrement c12)
   changed: (value c12) from 92 to 87
   goals met: 9 of 14
68. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 9 of 14
69. (increment c9)
   changed: (value c9) from 25 to 33
   goals met: 9 of 14
70. (increment c9)
   changed: (value c9) from 33 to 41
   goals met: 9 of 14
71. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 9 of 14
72. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 9 of 14
73. (increment c9)
   changed: (value c9) from 41 to 51
   goals met: 8 of 14
74. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 8 of 14
75. (increment c5)
   changed: (value c5) from 10 to 20
   goals met: 8 of 14
76. (increment c5)
   changed: (value c5) from 20 to 30
   goals met: 8 of 14
77. (increment c5)
   changed: (value c5) from 30 to 40
   goals met: 8 of 14
78. (increment c5)
   changed: (value c5) from 40 to 50
   goals met: 8 of 14
79. (increment c5)
   changed: (value c5) from 50 to 60
   goals met: 8 of 14
80. (increment c5)
   changed: (value c5) from 60 to 70
   goals met: 8 of 14
81. (increment c5)
   changed: (value c5) from 70 to 80
   goals met: 7 of 14
82. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 7 of 14
83. (increment c1)
   changed: (value c1) from 6 to 15
   goals met: 7 of 14
84. (increment c1)
   changed: (value c1) from 15 to 24
   goals met: 7 of 14
85. (increment c1)
   changed: (value c1) from 24 to 33
   goals met: 7 of 14
86. (increment c1)
   changed: (value c1) from 33 to 42
   goals met: 6 of 14
87. (increase_rate c0)
   changed: (rate_value c0) from 5 to 6
   goals met: 6 of 14
88. (increment c1)
   changed: (value c1) from 42 to 51
   goals met: 6 of 14
89. (decrement c0)
   changed: (value c0) from 88 to 82
   goals met: 6 of 14
90. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 6 of 14
91. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 6 of 14
92. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 6 of 14
93. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 6 of 14
94. (decrement c0)
   changed: (value c0) from 82 to 76
   goals met: 6 of 14
95. (decrement c0)
   changed: (value c0) from 76 to 70
   goals met: 6 of 14
96. (decrement c0)
   changed: (value c0) from 70 to 64
   goals met: 6 of 14
97. (decrement c0)
   changed: (value c0) from 64 to 58
   goals met: 6 of 14
98. (decrement c0)
   changed: (value c0) from 58 to 52
   goals met: 6 of 14
99. (decrement c0)
   changed: (value c0) from 52 to 46
   goals met: 7 of 14
100. (increment c2)
   changed: (value c2) from 39 to 42
   goals met: 7 of 14
101. (decrement c1)
   changed: (value c1) from 51 to 41
   goals met: 7 of 14
102. (decrement c0)
   changed: (value c0) from 46 to 40
   goals met: 8 of 14
103. (decrement c13)
   changed: (value c13) from 74 to 64
   goals met: 9 of 14
104. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 9 of 14
105. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 9 of 14
106. (decrement c12)
   changed: (value c12) from 87 to 80
   goals met: 9 of 14
107. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 9 of 14
108. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 9 of 14
109. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 9 of 14
110. (decrement c8)
   changed: (value c8) from 79 to 72
   goals met: 8 of 14
111. (decrement c8)
   changed: (value c8) from 72 to 65
   goals met: 8 of 14
112. (decrement c9)
   changed: (value c9) from 51 to 41
   goals met: 9 of 14
113. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 9 of 14
114. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 9 of 14
115. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 9 of 14
116. (increment c8)
   changed: (value c8) from 65 to 75
   goals met: 10 of 14
117. (decrement c12)
   changed: (value c12) from 80 to 73
   goals met: 9 of 14
118. (decrement c12)
   changed: (value c12) from 73 to 66
   goals met: 9 of 14
119. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 9 of 14
120. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 9 of 14
121. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 9 of 14
122. (increment c13)
   changed: (value c13) from 64 to 74
   goals met: 9 of 14
123. (increment c12)
   changed: (value c12) from 66 to 73
   goals met: 9 of 14
124. (decrement c11)
   changed: (value c11) from 78 to 75
   goals met: 9 of 14
125. (decrement c11)
   changed: (value c11) from 75 to 72
   goals met: 10 of 14
126. (decrement c13)
   changed: (value c13) from 74 to 64
   goals met: 10 of 14
127. (decrement c12)
   changed: (value c12) from 73 to 66
   goals met: 9 of 14
128. (decrement c12)
   changed: (value c12) from 66 to 59
   goals met: 10 of 14
129. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 10 of 14
130. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 10 of 14
131. (decrement c11)
   changed: (value c11) from 72 to 67
   goals met: 10 of 14
132. (decrement c11)
   changed: (value c11) from 67 to 62
   goals met: 10 of 14
133. (decrement c11)
   changed: (value c11) from 62 to 57
   goals met: 11 of 14
134. (decrement c5)
   changed: (value c5) from 80 to 70
   goals met: 12 of 14
135. (decrement c4)
   changed: (value c4) from 92 to 88
   goals met: 11 of 14
136. (decrement c4)
   changed: (value c4) from 88 to 84
   goals met: 11 of 14
137. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 11 of 14
138. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 11 of 14
139. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 11 of 14
140. (decrement c3)
   changed: (value c3) from 89 to 87
   goals met: 11 of 14
141. (decrement c3)
   changed: (value c3) from 87 to 85
   goals met: 11 of 14
142. (decrement c3)
   changed: (value c3) from 85 to 83
   goals met: 12 of 14
143. (increment c5)
   changed: (value c5) from 70 to 80
   goals met: 11 of 14
144. (decrement c4)
   changed: (value c4) from 84 to 79
   goals met: 11 of 14
145. (decrement c3)
   changed: (value c3) from 83 to 81
   goals met: 11 of 14
146. (decrement c3)
   changed: (value c3) from 81 to 79
   goals met: 11 of 14
147. (decrement c3)
   changed: (value c3) from 79 to 77
   goals met: 12 of 14
148. (decrement c5)
   changed: (value c5) from 80 to 70
   goals met: 12 of 14
149. (decrement c4)
   changed: (value c4) from 79 to 74
   goals met: 11 of 14
150. (decrement c4)
   changed: (value c4) from 74 to 69
   goals met: 12 of 14
151. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 12 of 14
152. (decrement c3)
   changed: (value c3) from 77 to 74
   goals met: 12 of 14
153. (decrement c3)
   changed: (value c3) from 74 to 71
   goals met: 12 of 14
154. (decrement c3)
   changed: (value c3) from 71 to 68
   goals met: 13 of 14
155. (increment c9)
   changed: (value c9) from 41 to 51
   goals met: 12 of 14
156. (increment c9)
   changed: (value c9) from 51 to 61
   goals met: 12 of 14
157. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 12 of 14
158. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 12 of 14
159. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 12 of 14
160. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 12 of 14
161. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 12 of 14
162. (increment c10)
   changed: (value c10) from 43 to 48
   goals met: 12 of 14
163. (increment c10)
   changed: (value c10) from 48 to 53
   goals met: 12 of 14
164. (increment c10)
   changed: (value c10) from 53 to 58
   goals met: 11 of 14
165. (increment c11)
   changed: (value c11) from 57 to 62
   goals met: 11 of 14
166. (increment c12)
   changed: (value c12) from 59 to 66
   goals met: 11 of 14
167. (increment c13)
   changed: (value c13) from 64 to 74
   goals met: 11 of 14
168. (increment c10)
   changed: (value c10) from 58 to 63
   goals met: 11 of 14
169. (increment c11)
   changed: (value c11) from 62 to 67
   goals met: 11 of 14
170. (increment c12)
   changed: (value c12) from 66 to 73
   goals met: 12 of 14
171. (increment c9)
   changed: (value c9) from 61 to 71
   goals met: 11 of 14
172. (increment c10)
   changed: (value c10) from 63 to 68
   goals met: 10 of 14
173. (increment c11)
   changed: (value c11) from 67 to 72
   goals met: 11 of 14
174. (increment c10)
   changed: (value c10) from 68 to 73
   goals met: 11 of 14
175. (increment c11)
   changed: (value c11) from 72 to 77
   goals met: 11 of 14
176. (increment c12)
   changed: (value c12) from 73 to 80
   goals met: 11 of 14
177. (increment c13)
   changed: (value c13) from 74 to 84
   goals met: 12 of 14
178. (increase_rate c14)
   changed: (rate_value c14) from 0 to 1
   goals met: 12 of 14
179. (increase_rate c14)
   changed: (rate_value c14) from 1 to 2
   goals met: 12 of 14
180. (increase_rate c14)
   changed: (rate_value c14) from 2 to 3
   goals met: 12 of 14
181. (increase_rate c14)
   changed: (rate_value c14) from 3 to 4
   goals met: 12 of 14
182. (increase_rate c14)
   changed: (rate_value c14) from 4 to 5
   goals met: 12 of 14
183. (increase_rate c14)
   changed: (rate_value c14) from 5 to 6
   goals met: 12 of 14
184. (increment c14)
   changed: (value c14) from 67 to 73
   goals met: 12 of 14
185. (increment c14)
   changed: (value c14) from 73 to 79
   goals met: 12 of 14
186. (increment c14)
   changed: (value c14) from 79 to 85
   goals met: 13 of 14
187. (increment c9)
   changed: (value c9) from 71 to 81
   goals met: 13 of 14
188. (increment c10)
   changed: (value c10) from 73 to 78
   goals met: 12 of 14
189. (increment c11)
   changed: (value c11) from 77 to 82
   goals met: 12 of 14
190. (increment c12)
   changed: (value c12) from 80 to 87
   goals met: 12 of 14
191. (increment c13)
   changed: (value c13) from 84 to 94
   goals met: 12 of 14
192. (increment c14)
   changed: (value c14) from 85 to 91
   goals met: 12 of 14
193. (increment c14)
   changed: (value c14) from 91 to 97
   goals met: 13 of 14
194. (decrement c9)
   changed: (value c9) from 81 to 71
   goals met: 13 of 14
195. (decrement c8)
   changed: (value c8) from 75 to 65
   goals met: 13 of 14
196. (decrement c7)
   changed: (value c7) from 74 to 71
   goals met: 12 of 14
197. (decrement c7)
   changed: (value c7) from 71 to 68
   goals met: 12 of 14
198. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 12 of 14
199. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 12 of 14
200. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 12 of 14
201. (decrement c7)
   changed: (value c7) from 68 to 64
   goals met: 13 of 14
202. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 13 of 14
203. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 13 of 14
204. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 13 of 14
205. (decrement c6)
   changed: (value c6) from 73 to 68
   goals met: 12 of 14
206. (decrement c6)
   changed: (value c6) from 68 to 63
   goals met: 13 of 14
207. (decrement c5)
   changed: (value c5) from 70 to 60
   goals met: 13 of 14
208. (decrement c4)
   changed: (value c4) from 69 to 64
   goals met: 12 of 14
209. (decrement c4)
   changed: (value c4) from 64 to 59
   goals met: 13 of 14
210. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 13 of 14
211. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 13 of 14
212. (decrement c3)
   changed: (value c3) from 68 to 63
   goals met: 13 of 14
213. (decrement c3)
   changed: (value c3) from 63 to 58
   goals met: 14 of 14
